Autodesk.Revit.DB.CloudPath.IsValidName(System.String)
A valid name contains at most getMaximumLengthForNames() characters and
does not contain any invalid characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.CloudPath.#ctor(System.Guid,System.String,System.Guid,System.String)
Constructs a CloudPath which represents a specified central model
in a specified A360 project.
projectId:
The GUID of the A360 project which contains the model.
projectName:
The name of the A360 project which contains the model.
modelId:
The GUID of the A360 .rvt model.
modelName:
The name of the A360 .rvt model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.CloudPath
This class represents a location in the A360 cloud, rather than a
location on disk, network drive or a Revit Server location.
Remarks:
CloudPaths must refer to Revit models.
CloudPaths are of the form "CLD:\\{Project_GUID}Project_Name\{Model_GUID}Model_Name.rvt".
The project name and GUID identify an A360 project.
The model name and GUID identify an A360 .rvt model.
For example, the following is a valid cloud path:
CLD:\\{E044A9E9-B73F-4FA6-B78F-9E86154AD937}555 Main St\{E1D7A263-084B-413B-A146-2C941E63966A}Library.rvt
Since:
2015